# EditOpenGLPrefs

## Description
Allows the user to edit OpenGL renderer preferences and stores them in the current drawing.

```pascal
PROCEDURE EditOpenGLPrefs(VAR updateRendering : BOOLEAN);
```

```python
def vs.EditOpenGLPrefs():
    return updateRendering
```

## Parameters
|Name|Type|Description|
|---|---|---|
|updateRendering|BOOLEAN|   |

## Version
Availability: from Vectorworks 2014

## Category
* View @ Zoom